import type { HealthCarePageContent } from "../types/health-care-content.types"

export const healthCarePageContent: HealthCarePageContent = {
  breadcrumbs: [{ label: "الرئيسية", href: "/" }, { label: "الرعاية الصحية" }],
  title: "الرعاية الصحية",
  description: "رحلات مميزة لأعضاء نقابة المهندسين بأسعار تفضيلية حصرية",
  subscribeLabel: "اشترك الان",
  rules: {
    title: "قواعد عامة",
    rules: [
      {
        marker: "1",
        text: "اشتراك العضو الأصلي شرط أساسي لاشتراك أي من الأعضاء التابعين",
      },
      {
        marker: "2",
        text: "في حالة وفاة العضو الأصلي، يحق للأعضاء التابعين الاستمرار في الاشتراك بالمشروع، مع الالتزام بجميع الشروط الموضحة أعلاه",
      },
      {
        marker: "3",
        text: "لا يجوز لأي عضو الاشتراك في المشروع بأكثر من كارنيه عضوية، منعًا لازدواجية الاستفادة من الخدمة",
      },
      {
        marker: "5",
        text: "اشتراك الأبناء يُعد أساسيًا في المشروع، ولا يجوز حذفهم إلا عند بلوغ سن الابنة 35 عامًا أو زواج، أيهما أقرب",
      },
      {
        marker: "6",
        text: "إذا كان الزوج أو الزوجة يتمتع بتغطية صحية أو تأمين طبي آخر، فإن اشتراكه في مشروع العلاج بالنقابة يكون اختياريًا، على أن يتم تقديم ما يُثبت ذلك. م القومى الخاص به.",
      },
    ],
  },
  specialCases: {
    title: "الحالات الخاصة",
    cases: [
      {
        title: "المهندس حديث التخرج",
        description:
          "الاشتراك إجباري في السنة الأولى فقط وفقًا لقرار المجلس الاعلى",
      },
      {
        title: "المولود الجديد",
        description:
          "خلال 4 أشهر من تاريخ الولادة، مع تقديم شهادة الميلاد أو إخطار الولادة يمكن إضافة المولود عند المساهمة في مصاريف الولادة للأم.",
      },
      {
        title: "الزواج الحديث",
        description:
          "خلال 3 اشهر من تاريخ وثيقة الزواج مع تقديم الوثيقة والرقم القومي للزوجة",
      },
    ],
  },
  requiredDocuments: {
    title: "المستندات المطلوبة",
    documents: [
      { marker: "1", text: "صورة كارنيه النقابة." },
      { marker: "2", text: "صورة بطاقة الرقم القومي." },
      { marker: "3", text: "إيصال سداد اشتراك النقابة للعام الحالي." },
      {
        marker: "4",
        text: "صورة شخصية لكل عضو (عدا الأطفال أقل من 3 سنوات).",
      },
      {
        marker: "5",
        text: "إثبات صلة القرابة للأعضاء التابعين بالعضو الأصلي (بالوثائق المعترف بها).",
      },
    ],
  },
  plans: [
    {
      id: "family",
      icon: "family",
      title: "رعاية عائلية",
      description:
        "رعاية عائلية خاصة بالمهندس المتقدم واسرته لجميع النواحي الصحية",
      price: 1800,
      currency: "جنيه",
      subscribeHref: "/health-care/family",
    },
    {
      id: "individual",
      icon: "individual",
      title: "رعاية فردية",
      description: "رعاية فردية خاصة بالمهندس المتقدم فقط لجميع النواحي الصحية",
      price: 1800,
      currency: "جنيه",
      subscribeHref: "/health-care/individual",
    },
  ],
}
